nc: 5
scale: s
scales:
  s: [0.50, 0.50, 1024]
cbam:
  enabled: true
  reduction_ratio: 16
  locations: [P3, P4, P5]
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, false, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, false, 0.25]]
  - [-1, 1, CBAM, [256, 16, true]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, true]]
  - [-1, 1, CBAM, [256, 16, true]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, true]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]
  - [-1, 1, CBAM, [512, 16, true]]
head:
  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, false]]
  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, false]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, false]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, true]]
  - [[19, 22, 25], 1, Detect, [nc]]
